## Python Libraries

# 1. pandas

In [1]:
import pandas as pd
print(pd.__version__)

1.5.3

In [2]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
import pandas as pd
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [4]:
import pandas as pd
dataset = {
    'cars': ['Tesla', 'Lambo', 'Fiat', 'Ferrari'],
    'make': ['2023', '2022', '2009', '2022']
}
df = pd.DataFrame(dataset)
df

      cars  make
0    Tesla  2023
1    Lambo  2022
2     Fiat  2009
3  Ferrari  2022

In [5]:
df['cars'][0]
print(f"First index item: {df['cars'][0]}")

First index item: Tesla

# Using series

In [6]:
import pandas as pd
dataset = {
    'cars': ['Tesla', 'Volvo', 'Porshe', 'Ferrari'],
    'make': ['2023', '2022', '2019', '2020']
}
s = pd.Series(dataset)
print(s)

cars    [Tesla, Volvo, Porshe, Ferrari]
make           [2023, 2022, 2019, 2020]
dtype: object

In [7]:
import pandas as pd
dataset = ['Tesla', 'Lamborghini', 'Porshe', 'Ferrari']
s = pd.Series(dataset)
print(s)

0          Tesla
1    Lamborghini
2         Porshe
3        Ferrari
dtype: object

## Assignment 1

In [8]:
#Series with days & dates from a dictionary
import pandas as pd
dates_set = {
    'days': ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
    'dates': ['01-07-2023', '02-07-2023', '03-07-2023', '04-07-2023', '05-07-2023', '06-07-2023', '07-07-2023']
}
s = pd.Series(dates_set)
days = []
index = -1
for j in s['days']:
    index = index + 1
    for i in s['dates']:
        days.append(i)
    print(j,":", days[index])

Monday : 01-07-2023
Tuesday : 02-07-2023
Wednesday : 03-07-2023
Thursday : 04-07-2023
Friday : 05-07-2023
Saturday : 06-07-2023
Sunday : 07-07-2023

In [9]:
#Create a series using only data from Monday and Tuesday
dates_set = {
    'days': ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday'],
    'dates': ['01-07-2023', '02-07-2023', '03-07-2023', '04-07-2023', '05-07-2023', '06-07-2023', '07-07-2023']
}
new_dates_set = []
for day in dates_set['days']:
    if day == 'Monday' or day == 'Tuesday':
        new_dates_set.append(day)
s = pd.Series(new_dates_set)
print(s)

0     Monday
1    Tuesday
dtype: object

# Assignment 2

In [10]:
#import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## mine.csv

In [11]:
#read data from mine.csv
df = pd.read_csv(r'datasets/mine.csv')

#for the first few rows of data
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [12]:
#for the last few rows
df.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [13]:
#information about the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [14]:
#number 0f rows before
num_rows = df.shape[0]
print("Number of rows before:", num_rows)

# Remove rows with missing values
df.dropna(axis=0, inplace=True)

# Remove columns with missing values
df.dropna(axis=1, inplace=True)

#number of rows after 
num_rows = df.shape[0]
print("Number of rows after:", num_rows)
print('-------------------------------------')

#info
df.info()

Number of rows before: 169
Number of rows after: 164
-------------------------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 164 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  164 non-null    int64
 1   Pulse     164 non-null    int64
 2   Maxpulse  164 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 6.4 KB

In [15]:
# Fill missing values with the mean of the column
df['Calories'].fillna(df['Calories'].mean(), inplace=True)

In [16]:
# Remove rows with negative pulse(if any)
df = df[df['Duration'] >= 0]

print(df)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [17]:
# Convert the 'Calories' column to integer format
df['Calories'] = df['Calories'].astype(int)

df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406

In [18]:
#number of rows before 
num_rows = df.shape[0]
print("Number of rows before:", num_rows)

# Remove duplicates (if any)
df.drop_duplicates(inplace=True)

#number of rows after 
num_rows = df.shape[0]
print("Number of rows after:", num_rows)

Number of rows before: 164
Number of rows after: 154

In [19]:
# Perform correlation analysis
correlation_matrix = df.corr()
print(correlation_matrix)

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.161192  0.009329  0.925149
Pulse    -0.161192  1.000000  0.782996  0.018850
Maxpulse  0.009329  0.782996  1.000000  0.203124
Calories  0.925149  0.018850  0.203124  1.000000

## Work.csv

In [20]:
#read data from Work.csv
df = pd.read_csv(r'datasets/Work.csv')

#for the first few rows of data
df.head()

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94

In [21]:
#for the last few rows
df.tail()

     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [22]:
#information about the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 356.0+ bytes

In [23]:
#number 0f rows before
num_rows = df.shape[0]
print("Number of rows before:", num_rows)

# Remove rows with missing values
df.dropna(axis=0, inplace=True)

# Remove columns with missing values
df.dropna(axis=1, inplace=True)

#number of rows after 
num_rows = df.shape[0]
print("Number of rows after:", num_rows)
print('-------------------------------------')

#info
df.info()

Number of rows before: 7
Number of rows after: 5
-------------------------------------
<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   city      5 non-null      object
 2   age       5 non-null      object
 3   py-score  5 non-null      object
dtypes: object(4)
memory usage: 200.0+ bytes

In [24]:
# Convert integer columns with string values to numeric data type
integer_columns = ['age', 'py-score']
for column in integer_columns:
    df[column] = pd.to_numeric(df[column], errors='coerce')

# Remove rows with missing or invalid values
df.dropna(subset=integer_columns, inplace=True)

df.head()

     Name     city  age  py-score
0    Emma  Kampala   23      90.0
1  Wilber    Mbale   26      75.0
4    Yeko   Tororo   20      94.0
6   Jesca  Mbarara   21      84.0

In [25]:
# Fill missing values with the mean of the column
df['py-score'].fillna(df['py-score'].mean(), inplace=True)

# Fill missing values with the mean of the column
df['age'].fillna(df['age'].mean(), inplace=True)

In [26]:
#number of rows before 
num_rows = df.shape[0]
print("Number of rows before:", num_rows)

# Remove duplicates (if any)
df.drop_duplicates(inplace=True)

#number of rows after 
num_rows = df.shape[0]
print("Number of rows after:", num_rows)

Number of rows before: 4
Number of rows after: 4

In [27]:
# Convert 'age' and 'py-score' columns to numeric data type
df['age'] = pd.to_numeric(df['age'], errors='coerce')
df['py-score'] = pd.to_numeric(df['py-score'], errors='coerce')

# Perform correlation analysis considering only numeric columns
correlation_matrix = df.corr(numeric_only=True)

# Display the correlation matrix
print(correlation_matrix)

               age  py-score
age       1.000000 -0.815891
py-score -0.815891  1.000000